app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Nari"], ["last_name", "Kuk"], ["created_at", "2019-12-17 18:45:57.461679"], ["updated_at", "2019-12-17 18:45:57.461679"]]
---
  def create
    @student = Student.new(student_params)
    # @student.new(params.require(:student).permit(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "John"], ["updated_at", "2019-12-17 18:51:44.410061"], ["id", 4]]
---
  def update
    @student = Student.find(params[:id])
    # @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
    # @student.update(params.require(:student).permit(:first_name, :last_name))
    @student.update(student_params)